espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_mem_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** I3C_MST_MEM_COMMAND_BUF_PORT_REG register
 *  NA
 */
#define I3C_MST_MEM_COMMAND_BUF_PORT_REG (DR_REG_I3C_MST_MEM_BASE + 0x8)
/** I3C_MST_MEM_REG_COMMAND : R/W; bitpos: [31:0]; default: 0;
 *  Contains a Command Descriptor structure that depends on the requested transfer
 *  type. Command Descriptor structure is used to schedule the transfers to devices on
 *  I3C bus.
 */
#define I3C_MST_MEM_REG_COMMAND    0xFFFFFFFFU
#define I3C_MST_MEM_REG_COMMAND_M  (I3C_MST_MEM_REG_COMMAND_V << I3C_MST_MEM_REG_COMMAND_S)
#define I3C_MST_MEM_REG_COMMAND_V  0xFFFFFFFFU
#define I3C_MST_MEM_REG_COMMAND_S  0

/** I3C_MST_MEM_RESPONSE_BUF_PORT_REG register
 *  NA
 */
#define I3C_MST_MEM_RESPONSE_BUF_PORT_REG (DR_REG_I3C_MST_MEM_BASE + 0xc)
/** I3C_MST_MEM_RESPONSE : RO; bitpos: [31:0]; default: 0;
 *  The Response Buffer can be read through this register. The response status for each
 *  Command is written into the Response Buffer by the controller if ROC (Response On
 *  Completion) bit is set or if transfer error has occurred. The response buffer can
 *  be read through this register.
 */
#define I3C_MST_MEM_RESPONSE    0xFFFFFFFFU
#define I3C_MST_MEM_RESPONSE_M  (I3C_MST_MEM_RESPONSE_V << I3C_MST_MEM_RESPONSE_S)
#define I3C_MST_MEM_RESPONSE_V  0xFFFFFFFFU
#define I3C_MST_MEM_RESPONSE_S  0

/** I3C_MST_MEM_RX_DATA_PORT_REG register
 *  NA
 */
#define I3C_MST_MEM_RX_DATA_PORT_REG (DR_REG_I3C_MST_MEM_BASE + 0x10)
/** I3C_MST_MEM_RX_DATA_PORT : RO; bitpos: [31:0]; default: 0;
 *  Receive Data Port. Receive data is mapped to the Rx-data buffer and receive data is
 *  always packed in 4-byte aligned data words.  If the length of data transfer is not
 *  aligned to 4-bytes boundary, then there will be extra(unused) bytes(the additional
 *  data bytes have to be ignored) at the end of the transferred data. The valid data
 *  must be identified using the DATA_LENGTH filed in the Response Descriptor.
 */
#define I3C_MST_MEM_RX_DATA_PORT    0xFFFFFFFFU
#define I3C_MST_MEM_RX_DATA_PORT_M  (I3C_MST_MEM_RX_DATA_PORT_V << I3C_MST_MEM_RX_DATA_PORT_S)
#define I3C_MST_MEM_RX_DATA_PORT_V  0xFFFFFFFFU
#define I3C_MST_MEM_RX_DATA_PORT_S  0

/** I3C_MST_MEM_TX_DATA_PORT_REG register
 *  NA
 */
#define I3C_MST_MEM_TX_DATA_PORT_REG (DR_REG_I3C_MST_MEM_BASE + 0x14)
/** I3C_MST_MEM_REG_TX_DATA_PORT : R/W; bitpos: [31:0]; default: 0;
 *  Transmit Data Port. Transmit data is mapped to the Tx-data  buffer and transmit
 *  data is always packed in 4-byte aligned data words.  If the length of data transfer
 *  is not aligned to 4-bytes boundary, then there will be extra(unused) bytes(the
 *  additional data bytes have to be ignored) at the end of the transferred data. The
 *  valid data must be identified using the DATA_LENGTH filed in the Response
 *  Descriptor.
 */
#define I3C_MST_MEM_REG_TX_DATA_PORT    0xFFFFFFFFU
#define I3C_MST_MEM_REG_TX_DATA_PORT_M  (I3C_MST_MEM_REG_TX_DATA_PORT_V << I3C_MST_MEM_REG_TX_DATA_PORT_S)
#define I3C_MST_MEM_REG_TX_DATA_PORT_V  0xFFFFFFFFU
#define I3C_MST_MEM_REG_TX_DATA_PORT_S  0

/** I3C_MST_MEM_IBI_STATUS_BUF_REG register
 *  In-Band Interrupt Buffer Status/Data Register. When receiving an IBI, IBI_PORT is
 *  used to both: Read the IBI Status Read the IBI Data(which is raw/opaque data)
 */
#define I3C_MST_MEM_IBI_STATUS_BUF_REG (DR_REG_I3C_MST_MEM_BASE + 0x18)
/** I3C_MST_MEM_DATA_LENGTH : RO; bitpos: [7:0]; default: 0;
 *  This field represents the length of data received along with IBI, in bytes.
 */
#define I3C_MST_MEM_DATA_LENGTH    0x000000FFU
#define I3C_MST_MEM_DATA_LENGTH_M  (I3C_MST_MEM_DATA_LENGTH_V << I3C_MST_MEM_DATA_LENGTH_S)
#define I3C_MST_MEM_DATA_LENGTH_V  0x000000FFU
#define I3C_MST_MEM_DATA_LENGTH_S  0
/** I3C_MST_MEM_IBI_ID : RO; bitpos: [15:8]; default: 0;
 *  IBI Identifier. The byte received after START which includes the address the R/W
 *  bit: Device  address and R/W bit in case of Slave Interrupt or Master Request.
 */
#define I3C_MST_MEM_IBI_ID    0x000000FFU
#define I3C_MST_MEM_IBI_ID_M  (I3C_MST_MEM_IBI_ID_V << I3C_MST_MEM_IBI_ID_S)
#define I3C_MST_MEM_IBI_ID_V  0x000000FFU
#define I3C_MST_MEM_IBI_ID_S  8
/** I3C_MST_MEM_IBI_STS : RO; bitpos: [28]; default: 0;
 *  IBI received data/status. IBI Data register is mapped to the IBI Buffer. The IBI
 *  Data is always packed in4-byte aligned and put to the IBI Buffer. This register
 *  When read from, reads the data from the IBI buffer. IBI Status register when read
 *  from, returns the data from the IBI Buffer and indicates how the controller
 *  responded to incoming IBI(SIR, MR and HJ).
 */
#define I3C_MST_MEM_IBI_STS    (BIT(28))
#define I3C_MST_MEM_IBI_STS_M  (I3C_MST_MEM_IBI_STS_V << I3C_MST_MEM_IBI_STS_S)
#define I3C_MST_MEM_IBI_STS_V  0x00000001U
#define I3C_MST_MEM_IBI_STS_S  28

/** I3C_MST_MEM_IBI_DATA_BUF_REG register
 *  NA
 */
#define I3C_MST_MEM_IBI_DATA_BUF_REG (DR_REG_I3C_MST_MEM_BASE + 0x40)
/** I3C_MST_MEM_IBI_DATA : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_IBI_DATA    0xFFFFFFFFU
#define I3C_MST_MEM_IBI_DATA_M  (I3C_MST_MEM_IBI_DATA_V << I3C_MST_MEM_IBI_DATA_S)
#define I3C_MST_MEM_IBI_DATA_V  0xFFFFFFFFU
#define I3C_MST_MEM_IBI_DATA_S  0

/** I3C_MST_MEM_DEV_ADDR_TABLE1_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE1_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xc0)
/** I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV1_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV1_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV1_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV1_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV1_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV1_I2C_M  (I3C_MST_MEM_REG_DAT_DEV1_I2C_V << I3C_MST_MEM_REG_DAT_DEV1_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV1_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV1_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE2_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE2_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xc4)
/** I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV2_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV2_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV2_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV2_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV2_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV2_I2C_M  (I3C_MST_MEM_REG_DAT_DEV2_I2C_V << I3C_MST_MEM_REG_DAT_DEV2_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV2_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV2_I2C_S  31

