espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_mem_reg.h
/** I3C_MST_MEM_DEV_ADDR_TABLE3_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE3_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xc8)
/** I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV3_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV3_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV3_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV3_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV3_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV3_I2C_M  (I3C_MST_MEM_REG_DAT_DEV3_I2C_V << I3C_MST_MEM_REG_DAT_DEV3_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV3_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV3_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE4_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE4_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xcc)
/** I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV4_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV4_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV4_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV4_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV4_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV4_I2C_M  (I3C_MST_MEM_REG_DAT_DEV4_I2C_V << I3C_MST_MEM_REG_DAT_DEV4_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV4_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV4_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE5_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE5_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xd0)
/** I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV5_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV5_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV5_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV5_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV5_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV5_I2C_M  (I3C_MST_MEM_REG_DAT_DEV5_I2C_V << I3C_MST_MEM_REG_DAT_DEV5_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV5_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV5_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE6_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE6_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xd4)
/** I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV6_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV6_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV6_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV6_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV6_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV6_I2C_M  (I3C_MST_MEM_REG_DAT_DEV6_I2C_V << I3C_MST_MEM_REG_DAT_DEV6_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV6_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV6_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE7_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE7_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xd8)
/** I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV7_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV7_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV7_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV7_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV7_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV7_I2C_M  (I3C_MST_MEM_REG_DAT_DEV7_I2C_V << I3C_MST_MEM_REG_DAT_DEV7_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV7_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV7_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE8_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE8_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xdc)
/** I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV8_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV8_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV8_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV8_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV8_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV8_I2C_M  (I3C_MST_MEM_REG_DAT_DEV8_I2C_V << I3C_MST_MEM_REG_DAT_DEV8_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV8_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV8_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE9_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE9_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xe0)
/** I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV9_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV9_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV9_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV9_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV9_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV9_I2C_M  (I3C_MST_MEM_REG_DAT_DEV9_I2C_V << I3C_MST_MEM_REG_DAT_DEV9_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV9_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV9_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE10_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE10_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xe4)
/** I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV10_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV10_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV10_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV10_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV10_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV10_I2C_M  (I3C_MST_MEM_REG_DAT_DEV10_I2C_V << I3C_MST_MEM_REG_DAT_DEV10_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV10_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV10_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE11_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE11_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xe8)
/** I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV11_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV11_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV11_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV11_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV11_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV11_I2C_M  (I3C_MST_MEM_REG_DAT_DEV11_I2C_V << I3C_MST_MEM_REG_DAT_DEV11_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV11_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV11_I2C_S  31

/** I3C_MST_MEM_DEV_ADDR_TABLE12_LOC_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_ADDR_TABLE12_LOC_REG (DR_REG_I3C_MST_MEM_BASE + 0xec)
/** I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR : R/W; bitpos: [6:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR    0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR_V  0x0000007FU
#define I3C_MST_MEM_REG_DAT_DEV12_STATIC_ADDR_S  0
/** I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR : R/W; bitpos: [23:16]; default: 0;
 *  Device Dynamic Address with parity, The MSB,bit[23], should be programmed with
 *  parity of dynamic address.
 */
#define I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR    0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR_M  (I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR_V << I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR_S)
#define I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR_V  0x000000FFU
#define I3C_MST_MEM_REG_DAT_DEV12_DYNAMIC_ADDR_S  16
/** I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT : R/W; bitpos: [30:29]; default: 0;
 *  This field is used to set the Device NACK Retry count for the particular device. If
 *  the Device NACK's for the device address, the controller automatically retries the
 *  same device until this count expires. If the Slave does not ACK for the mentioned
 *  number of retries, then controller generates an error response and move to the Halt
 *  state.
 */
#define I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT    0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT_M  (I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT_V << I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT_S)
#define I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT_V  0x00000003U
#define I3C_MST_MEM_REG_DAT_DEV12_NACK_RETRY_CNT_S  29
/** I3C_MST_MEM_REG_DAT_DEV12_I2C : R/W; bitpos: [31]; default: 0;
 *  Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C
 *  device.
 */
#define I3C_MST_MEM_REG_DAT_DEV12_I2C    (BIT(31))
#define I3C_MST_MEM_REG_DAT_DEV12_I2C_M  (I3C_MST_MEM_REG_DAT_DEV12_I2C_V << I3C_MST_MEM_REG_DAT_DEV12_I2C_S)
#define I3C_MST_MEM_REG_DAT_DEV12_I2C_V  0x00000001U
#define I3C_MST_MEM_REG_DAT_DEV12_I2C_S  31

/** I3C_MST_MEM_DEV_CHAR_TABLE1_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE1_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x100)
/** I3C_MST_MEM_DCT_DEV1_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV1_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC1_M  (I3C_MST_MEM_DCT_DEV1_LOC1_V << I3C_MST_MEM_DCT_DEV1_LOC1_S)
#define I3C_MST_MEM_DCT_DEV1_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE1_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE1_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x104)
/** I3C_MST_MEM_DCT_DEV1_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV1_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC2_M  (I3C_MST_MEM_DCT_DEV1_LOC2_V << I3C_MST_MEM_DCT_DEV1_LOC2_S)
#define I3C_MST_MEM_DCT_DEV1_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC2_S  0

