espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_mem_reg.h
/** I3C_MST_MEM_DEV_CHAR_TABLE1_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE1_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x108)
/** I3C_MST_MEM_DCT_DEV1_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV1_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC3_M  (I3C_MST_MEM_DCT_DEV1_LOC3_V << I3C_MST_MEM_DCT_DEV1_LOC3_S)
#define I3C_MST_MEM_DCT_DEV1_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE1_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE1_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x10c)
/** I3C_MST_MEM_DCT_DEV1_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV1_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC4_M  (I3C_MST_MEM_DCT_DEV1_LOC4_V << I3C_MST_MEM_DCT_DEV1_LOC4_S)
#define I3C_MST_MEM_DCT_DEV1_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV1_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE2_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE2_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x110)
/** I3C_MST_MEM_DCT_DEV2_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV2_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC1_M  (I3C_MST_MEM_DCT_DEV2_LOC1_V << I3C_MST_MEM_DCT_DEV2_LOC1_S)
#define I3C_MST_MEM_DCT_DEV2_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE2_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE2_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x114)
/** I3C_MST_MEM_DCT_DEV2_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV2_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC2_M  (I3C_MST_MEM_DCT_DEV2_LOC2_V << I3C_MST_MEM_DCT_DEV2_LOC2_S)
#define I3C_MST_MEM_DCT_DEV2_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE2_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE2_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x118)
/** I3C_MST_MEM_DCT_DEV2_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV2_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC3_M  (I3C_MST_MEM_DCT_DEV2_LOC3_V << I3C_MST_MEM_DCT_DEV2_LOC3_S)
#define I3C_MST_MEM_DCT_DEV2_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE2_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE2_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x11c)
/** I3C_MST_MEM_DCT_DEV2_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV2_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC4_M  (I3C_MST_MEM_DCT_DEV2_LOC4_V << I3C_MST_MEM_DCT_DEV2_LOC4_S)
#define I3C_MST_MEM_DCT_DEV2_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV2_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE3_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE3_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x120)
/** I3C_MST_MEM_DCT_DEV3_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV3_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC1_M  (I3C_MST_MEM_DCT_DEV3_LOC1_V << I3C_MST_MEM_DCT_DEV3_LOC1_S)
#define I3C_MST_MEM_DCT_DEV3_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE3_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE3_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x124)
/** I3C_MST_MEM_DCT_DEV3_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV3_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC2_M  (I3C_MST_MEM_DCT_DEV3_LOC2_V << I3C_MST_MEM_DCT_DEV3_LOC2_S)
#define I3C_MST_MEM_DCT_DEV3_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE3_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE3_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x128)
/** I3C_MST_MEM_DCT_DEV3_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV3_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC3_M  (I3C_MST_MEM_DCT_DEV3_LOC3_V << I3C_MST_MEM_DCT_DEV3_LOC3_S)
#define I3C_MST_MEM_DCT_DEV3_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE3_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE3_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x12c)
/** I3C_MST_MEM_DCT_DEV3_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV3_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC4_M  (I3C_MST_MEM_DCT_DEV3_LOC4_V << I3C_MST_MEM_DCT_DEV3_LOC4_S)
#define I3C_MST_MEM_DCT_DEV3_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV3_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE4_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE4_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x130)
/** I3C_MST_MEM_DCT_DEV4_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV4_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC1_M  (I3C_MST_MEM_DCT_DEV4_LOC1_V << I3C_MST_MEM_DCT_DEV4_LOC1_S)
#define I3C_MST_MEM_DCT_DEV4_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE4_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE4_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x134)
/** I3C_MST_MEM_DCT_DEV4_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV4_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC2_M  (I3C_MST_MEM_DCT_DEV4_LOC2_V << I3C_MST_MEM_DCT_DEV4_LOC2_S)
#define I3C_MST_MEM_DCT_DEV4_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE4_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE4_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x138)
/** I3C_MST_MEM_DCT_DEV4_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV4_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC3_M  (I3C_MST_MEM_DCT_DEV4_LOC3_V << I3C_MST_MEM_DCT_DEV4_LOC3_S)
#define I3C_MST_MEM_DCT_DEV4_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE4_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE4_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x13c)
/** I3C_MST_MEM_DCT_DEV4_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV4_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC4_M  (I3C_MST_MEM_DCT_DEV4_LOC4_V << I3C_MST_MEM_DCT_DEV4_LOC4_S)
#define I3C_MST_MEM_DCT_DEV4_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV4_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE5_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE5_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x140)
/** I3C_MST_MEM_DCT_DEV5_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV5_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC1_M  (I3C_MST_MEM_DCT_DEV5_LOC1_V << I3C_MST_MEM_DCT_DEV5_LOC1_S)
#define I3C_MST_MEM_DCT_DEV5_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC1_S  0

