espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_mem_reg.h
/** I3C_MST_MEM_DEV_CHAR_TABLE5_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE5_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x144)
/** I3C_MST_MEM_DCT_DEV5_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV5_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC2_M  (I3C_MST_MEM_DCT_DEV5_LOC2_V << I3C_MST_MEM_DCT_DEV5_LOC2_S)
#define I3C_MST_MEM_DCT_DEV5_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE5_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE5_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x148)
/** I3C_MST_MEM_DCT_DEV5_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV5_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC3_M  (I3C_MST_MEM_DCT_DEV5_LOC3_V << I3C_MST_MEM_DCT_DEV5_LOC3_S)
#define I3C_MST_MEM_DCT_DEV5_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE5_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE5_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x14c)
/** I3C_MST_MEM_DCT_DEV5_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV5_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC4_M  (I3C_MST_MEM_DCT_DEV5_LOC4_V << I3C_MST_MEM_DCT_DEV5_LOC4_S)
#define I3C_MST_MEM_DCT_DEV5_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV5_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE6_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE6_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x150)
/** I3C_MST_MEM_DCT_DEV6_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV6_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC1_M  (I3C_MST_MEM_DCT_DEV6_LOC1_V << I3C_MST_MEM_DCT_DEV6_LOC1_S)
#define I3C_MST_MEM_DCT_DEV6_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE6_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE6_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x154)
/** I3C_MST_MEM_DCT_DEV6_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV6_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC2_M  (I3C_MST_MEM_DCT_DEV6_LOC2_V << I3C_MST_MEM_DCT_DEV6_LOC2_S)
#define I3C_MST_MEM_DCT_DEV6_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE6_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE6_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x158)
/** I3C_MST_MEM_DCT_DEV6_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV6_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC3_M  (I3C_MST_MEM_DCT_DEV6_LOC3_V << I3C_MST_MEM_DCT_DEV6_LOC3_S)
#define I3C_MST_MEM_DCT_DEV6_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE6_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE6_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x15c)
/** I3C_MST_MEM_DCT_DEV6_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV6_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC4_M  (I3C_MST_MEM_DCT_DEV6_LOC4_V << I3C_MST_MEM_DCT_DEV6_LOC4_S)
#define I3C_MST_MEM_DCT_DEV6_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV6_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE7_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE7_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x160)
/** I3C_MST_MEM_DCT_DEV7_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV7_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC1_M  (I3C_MST_MEM_DCT_DEV7_LOC1_V << I3C_MST_MEM_DCT_DEV7_LOC1_S)
#define I3C_MST_MEM_DCT_DEV7_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE7_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE7_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x164)
/** I3C_MST_MEM_DCT_DEV7_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV7_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC2_M  (I3C_MST_MEM_DCT_DEV7_LOC2_V << I3C_MST_MEM_DCT_DEV7_LOC2_S)
#define I3C_MST_MEM_DCT_DEV7_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE7_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE7_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x168)
/** I3C_MST_MEM_DCT_DEV7_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV7_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC3_M  (I3C_MST_MEM_DCT_DEV7_LOC3_V << I3C_MST_MEM_DCT_DEV7_LOC3_S)
#define I3C_MST_MEM_DCT_DEV7_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE7_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE7_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x16c)
/** I3C_MST_MEM_DCT_DEV7_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV7_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC4_M  (I3C_MST_MEM_DCT_DEV7_LOC4_V << I3C_MST_MEM_DCT_DEV7_LOC4_S)
#define I3C_MST_MEM_DCT_DEV7_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV7_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE8_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE8_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x170)
/** I3C_MST_MEM_DCT_DEV8_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV8_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC1_M  (I3C_MST_MEM_DCT_DEV8_LOC1_V << I3C_MST_MEM_DCT_DEV8_LOC1_S)
#define I3C_MST_MEM_DCT_DEV8_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE8_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE8_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x174)
/** I3C_MST_MEM_DCT_DEV8_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV8_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC2_M  (I3C_MST_MEM_DCT_DEV8_LOC2_V << I3C_MST_MEM_DCT_DEV8_LOC2_S)
#define I3C_MST_MEM_DCT_DEV8_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE8_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE8_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x178)
/** I3C_MST_MEM_DCT_DEV8_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV8_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC3_M  (I3C_MST_MEM_DCT_DEV8_LOC3_V << I3C_MST_MEM_DCT_DEV8_LOC3_S)
#define I3C_MST_MEM_DCT_DEV8_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE8_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE8_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x17c)
/** I3C_MST_MEM_DCT_DEV8_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV8_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC4_M  (I3C_MST_MEM_DCT_DEV8_LOC4_V << I3C_MST_MEM_DCT_DEV8_LOC4_S)
#define I3C_MST_MEM_DCT_DEV8_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV8_LOC4_S  0

