espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/i3c_mst_mem_reg.h
/** I3C_MST_MEM_DEV_CHAR_TABLE9_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE9_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x180)
/** I3C_MST_MEM_DCT_DEV9_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV9_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC1_M  (I3C_MST_MEM_DCT_DEV9_LOC1_V << I3C_MST_MEM_DCT_DEV9_LOC1_S)
#define I3C_MST_MEM_DCT_DEV9_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE9_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE9_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x184)
/** I3C_MST_MEM_DCT_DEV9_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV9_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC2_M  (I3C_MST_MEM_DCT_DEV9_LOC2_V << I3C_MST_MEM_DCT_DEV9_LOC2_S)
#define I3C_MST_MEM_DCT_DEV9_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE9_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE9_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x188)
/** I3C_MST_MEM_DCT_DEV9_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV9_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC3_M  (I3C_MST_MEM_DCT_DEV9_LOC3_V << I3C_MST_MEM_DCT_DEV9_LOC3_S)
#define I3C_MST_MEM_DCT_DEV9_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE9_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE9_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x18c)
/** I3C_MST_MEM_DCT_DEV9_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV9_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC4_M  (I3C_MST_MEM_DCT_DEV9_LOC4_V << I3C_MST_MEM_DCT_DEV9_LOC4_S)
#define I3C_MST_MEM_DCT_DEV9_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV9_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE10_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE10_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x190)
/** I3C_MST_MEM_DCT_DEV10_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV10_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC1_M  (I3C_MST_MEM_DCT_DEV10_LOC1_V << I3C_MST_MEM_DCT_DEV10_LOC1_S)
#define I3C_MST_MEM_DCT_DEV10_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE10_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE10_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x194)
/** I3C_MST_MEM_DCT_DEV10_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV10_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC2_M  (I3C_MST_MEM_DCT_DEV10_LOC2_V << I3C_MST_MEM_DCT_DEV10_LOC2_S)
#define I3C_MST_MEM_DCT_DEV10_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE10_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE10_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x198)
/** I3C_MST_MEM_DCT_DEV10_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV10_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC3_M  (I3C_MST_MEM_DCT_DEV10_LOC3_V << I3C_MST_MEM_DCT_DEV10_LOC3_S)
#define I3C_MST_MEM_DCT_DEV10_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE10_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE10_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x19c)
/** I3C_MST_MEM_DCT_DEV10_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV10_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC4_M  (I3C_MST_MEM_DCT_DEV10_LOC4_V << I3C_MST_MEM_DCT_DEV10_LOC4_S)
#define I3C_MST_MEM_DCT_DEV10_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV10_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE11_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE11_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x1a0)
/** I3C_MST_MEM_DCT_DEV11_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV11_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC1_M  (I3C_MST_MEM_DCT_DEV11_LOC1_V << I3C_MST_MEM_DCT_DEV11_LOC1_S)
#define I3C_MST_MEM_DCT_DEV11_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE11_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE11_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x1a4)
/** I3C_MST_MEM_DCT_DEV11_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV11_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC2_M  (I3C_MST_MEM_DCT_DEV11_LOC2_V << I3C_MST_MEM_DCT_DEV11_LOC2_S)
#define I3C_MST_MEM_DCT_DEV11_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE11_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE11_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x1a8)
/** I3C_MST_MEM_DCT_DEV11_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV11_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC3_M  (I3C_MST_MEM_DCT_DEV11_LOC3_V << I3C_MST_MEM_DCT_DEV11_LOC3_S)
#define I3C_MST_MEM_DCT_DEV11_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE11_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE11_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x1ac)
/** I3C_MST_MEM_DCT_DEV11_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV11_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC4_M  (I3C_MST_MEM_DCT_DEV11_LOC4_V << I3C_MST_MEM_DCT_DEV11_LOC4_S)
#define I3C_MST_MEM_DCT_DEV11_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV11_LOC4_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE12_LOC1_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE12_LOC1_REG (DR_REG_I3C_MST_MEM_BASE + 0x1b0)
/** I3C_MST_MEM_DCT_DEV12_LOC1 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV12_LOC1    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC1_M  (I3C_MST_MEM_DCT_DEV12_LOC1_V << I3C_MST_MEM_DCT_DEV12_LOC1_S)
#define I3C_MST_MEM_DCT_DEV12_LOC1_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC1_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE12_LOC2_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE12_LOC2_REG (DR_REG_I3C_MST_MEM_BASE + 0x1b4)
/** I3C_MST_MEM_DCT_DEV12_LOC2 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV12_LOC2    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC2_M  (I3C_MST_MEM_DCT_DEV12_LOC2_V << I3C_MST_MEM_DCT_DEV12_LOC2_S)
#define I3C_MST_MEM_DCT_DEV12_LOC2_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC2_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE12_LOC3_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE12_LOC3_REG (DR_REG_I3C_MST_MEM_BASE + 0x1b8)
/** I3C_MST_MEM_DCT_DEV12_LOC3 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV12_LOC3    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC3_M  (I3C_MST_MEM_DCT_DEV12_LOC3_V << I3C_MST_MEM_DCT_DEV12_LOC3_S)
#define I3C_MST_MEM_DCT_DEV12_LOC3_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC3_S  0

/** I3C_MST_MEM_DEV_CHAR_TABLE12_LOC4_REG register
 *  NA
 */
#define I3C_MST_MEM_DEV_CHAR_TABLE12_LOC4_REG (DR_REG_I3C_MST_MEM_BASE + 0x1bc)
/** I3C_MST_MEM_DCT_DEV12_LOC4 : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define I3C_MST_MEM_DCT_DEV12_LOC4    0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC4_M  (I3C_MST_MEM_DCT_DEV12_LOC4_V << I3C_MST_MEM_DCT_DEV12_LOC4_S)
#define I3C_MST_MEM_DCT_DEV12_LOC4_V  0xFFFFFFFFU
#define I3C_MST_MEM_DCT_DEV12_LOC4_S  0

#ifdef __cplusplus
}
#endif
